create_clock -period 60.000 -name CLK_1 -waveform {0.000 30.000} [get_ports CLK]

set_input_delay -clock [get_clocks CLK_1] -clock_fall -min -add_delay 0.050 [get_ports {E[*]}]
set_input_delay -clock [get_clocks CLK_1] -clock_fall -max -add_delay 0.100 [get_ports {E[*]}]
set_input_delay -clock [get_clocks CLK_1] -clock_fall -min -add_delay 0.050 [get_ports {M[*]}]
set_input_delay -clock [get_clocks CLK_1] -clock_fall -max -add_delay 0.100 [get_ports {M[*]}]
set_input_delay -clock [get_clocks CLK_1] -clock_fall -min -add_delay 0.050 [get_ports {N[*]}]
set_input_delay -clock [get_clocks CLK_1] -clock_fall -max -add_delay 0.100 [get_ports {N[*]}]
set_input_delay -clock [get_clocks CLK_1] -clock_fall -min -add_delay 0.050 [get_ports {r2[*]}]
set_input_delay -clock [get_clocks CLK_1] -clock_fall -max -add_delay 0.100 [get_ports {r2[*]}]
set_input_delay -clock [get_clocks CLK_1] -min -add_delay 0.050 [get_ports RST]
set_input_delay -clock [get_clocks CLK_1] -max -add_delay 0.100 [get_ports RST]
set_output_delay -clock [get_clocks CLK_1] -clock_fall -min -add_delay 0.050 [get_ports {C[*]}]
set_output_delay -clock [get_clocks CLK_1] -clock_fall -max -add_delay 0.100 [get_ports {C[*]}]
set_output_delay -clock [get_clocks CLK_1] -min -add_delay 0.050 [get_ports valid_out]
set_output_delay -clock [get_clocks CLK_1] -max -add_delay 0.100 [get_ports valid_out]
